R1:
Router>en
Router#config t

Router(config)#int gig0/0/0
Router(config-if)#ip address 192.168.10.1 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#ex

Router(config)#int gig0/0/1
Router(config-if)#ip address 192.168.20.1 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#ex

Router(config)#int Se0/1/1
Router(config-if)#ip address 10.1.1.1 255.255.255.252
Router(config-if)#clock rate 64000
This command applies only to DCE interfaces
Router(config-if)#bandwidth 64
Router(config-if)#no shutdown
Router(config-if)#ex
Router(config)#ex
Router#
wr

R2:
Router>en
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int gig0/0/1
Router(config-if)#ip address 192.168.30.1 255.255.255.0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/1, changed state to up

Router(config-if)#ex
Router(config)#int gig0/0/0
Router(config-if)#ip address 192.168.40.1 255.255.255.0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up

Router(config-if)#ex
Router(config)#int Se0/1/0
Router(config-if)#ip address 10.1.2.1 255.255.255.252
Router(config-if)#clock rate 64000
Router(config-if)#bandwidth 64
Router(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial0/1/0, changed state to down
Router(config-if)#ex
Router(config)#ex
Router#
%SYS-5-CONFIG_I: Configured from console by console
wr
Building configuration...
[OK]

R3:
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int Se0/1/1
Router(config-if)#ip address 10.1.1.2 255.255.255.252
Router(config-if)#clock rate 64000
Router(config-if)#bandwidth 64
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface Serial0/1/1, changed state to up

Router(config-if)#ex
Router(config)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/1/1, changed state to up

Router(config)#int se0/1/0
Router(config-if)#ip address 10.2.1.1 255.255.255.252
Router(config-if)#clock rate 64000
This command applies only to DCE interfaces
Router(config-if)#bandwidth 64
Router(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial0/1/0, changed state to down
Router(config-if)#ex
Router(config)#int se0/2/0
Router(config-if)#ip address 10.1.2.1 255.255.255.252
Router(config-if)#clock rate 64000
This command applies only to DCE interfaces
Router(config-if)#bandwidth 64
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface Serial0/2/0, changed state to up

Router(config-if)#ex
Router(config)#ex
Router#
%SYS-5-CONFIG_I: Configured from console by console
wr

R4:

Router>en
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int gig0/0/0
Router(config-if)#ip address 192.168.50.1 255.255.255.0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up

Router(config-if)#ex
Router(config)#int gig0/0/1
Router(config-if)#ip address 192.168.60.1 255.255.255.0
Router(config-if)#no shutdown

Router(config-if)#ex
Router(config)#int se0/1/1
Router(config-if)#ip address 192.168.1.1 255.255.255.252
Router(config-if)#clock rate 64000
Router(config-if)#bandwidth 64
Router(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial0/1/1, changed state to down
Router(config-if)#ex
Router(config)#ex
Router#
%SYS-5-CONFIG_I: Configured from console by console
wr
Building configuration...
[OK]

R5:
Router>en
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int gig0/0/1
Router(config-if)#ip address 192.168.70.1 255.255.255.0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/1, changed state to up

Router(config-if)#ex
Router(config)#int gig0/0/0
Router(config-if)#ip address 192.168.80.1 255.255.255.0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up

Router(config-if)#ex
Router(config)#int se0/1/0
Router(config-if)#ip address 192.168.2.1 255.255.255.252
Router(config-if)#clock rate 64000
Router(config-if)#bandwidth 64
Router(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial0/1/0, changed state to down
Router(config-if)#ex
Router(config)#ex
Router#
%SYS-5-CONFIG_I: Configured from console by console
wr
Building configuration...
[OK]
Router#

R6:
Router>en
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
	
Router(config)#int se0/1/1
Router(config-if)#ip address 192.168.1.2 255.255.255.252
Router(config-if)#clock rate 64000
This command applies only to DCE interfaces
Router(config-if)#bandwidth 64
Router(config-if)#no shutdown

Router(config-if)#ex
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/1/1, changed state to up

Router(config)#int se0/2/0
Router(config-if)#ip address 192.168.2.2 255.255.255.252
Router(config-if)#clock rate 64000
This command applies only to DCE interfaces
Router(config-if)#bandwidth 64
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface Serial0/2/0, changed state to up

Router(config-if)#ex
Router(config)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/2/0, changed state to up

Router(config)#int se0/1/0
Router(config-if)#ip address 10.2.1.2 255.255.255.252
Router(config-if)#clock rate 64000
Router(config-if)#bandwidth 64
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface Serial0/1/0, changed state to up

Router(config-if)#ex
Router(config)#ex
Router#
%SYS-5-CONFIG_I: Configured from console by console
wr
Building configuration...
[OK]
Router#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/1/0, changed state to up


